In [1]:
import pandas as pd
df = pd.read_csv('vgsales.csv')

In [5]:
cols = list(df.columns)
df = df[cols[0:6] + [cols[-1]] + cols[6:8]]
df.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,Total_Sales,NA_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,124.23,41.49,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,69.32,29.08,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,51.67,15.85,35.82

In [3]:
df['Total_Sales'] = df['NA_Sales'] + df['Global_Sales']

In [4]:
df.head(2)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,Global_Sales,Total_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,82.74,124.23
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,40.24,69.32

In [2]:
df.head(4)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,33.00

In [7]:
df.to_csv('newvgsales.csv',index=False)

In [8]:
df.loc[(df['Year'] > 2005) & (df['Total_Sales'] > 100) & (df['Platform'] == "PS3")]

Empty DataFrame
Columns: [Rank, Name, Platform, Year, Genre, Publisher, Total_Sales, NA_Sales, Global_Sales]
Index: []

In [10]:
df.loc[(df['Year'] > 2005) & (df['Total_Sales'] > 50) & (df['Platform'] == "Wii")]

,Rank,Name,Platform,Year,Genre,Publisher,Total_Sales,NA_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,124.23,41.49,82.74
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,51.67,15.85,35.82

In [13]:
new_df = df.loc[(df['Year'] > 2005) & (df['Total_Sales'] > 50) & (df['Platform'] == "Wii")]
new_df.to_csv('filtered.csv')
new_df = new_df.reset_index(drop = True)

In [14]:
df

,Rank,Name,Platform,Year,Genre,Publisher,Total_Sales,NA_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,124.23,41.49,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,69.32,29.08,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,51.67,15.85,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,48.75,15.75,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,42.64,11.27,31.37
...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.02,0.01,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.02,0.01,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.01,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.01,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.02,0.01,0.01

In [16]:
df.loc[df['Total_Sales'] > 50, ['Status']] = 'Good'

In [17]:
df.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,Total_Sales,NA_Sales,Global_Sales,Status
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,124.23,41.49,82.74,Good
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,69.32,29.08,40.24,Good
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,51.67,15.85,35.82,Good

In [24]:
df = pd.read_csv('vgsales.csv')
df.groupby(['Global_Sales']).mean().sort_values('Rank',ascending= False)

                      Rank         Year   NA_Sales
Global_Sales
0.01          16291.500000  2009.158678   0.002460
0.02          15447.000000  2008.510010   0.004874
0.03          14505.876695  2007.959849   0.008594
0.04          13777.000000  2007.492114   0.013907
0.05          13138.500000  2006.961538   0.020744
...                    ...          ...        ...
31.37             5.000000  1996.000000  11.270000
33.00             4.000000  2009.000000  15.750000
35.82             3.000000  2008.000000  15.850000
40.24             2.000000  1985.000000  29.080000
82.74             1.000000  2006.000000  41.490000

[623 rows x 3 columns]